#+PROPERTY: header-args:sql     :exports both
#+PROPERTY: header-args:sql+    :engine postgresql
#+PROPERTY: header-args:sql+    :dbhost localhost
#+PROPERTY: header-args:sql+    :dbuser unep
#+PROPERTY: header-args:sql+    :dbpassword password
#+PROPERTY: header-args:sql+    :database gpml
#+PROPERTY: header-args :tangle initiative-view.sql
#+STARTUP: showall

#+BEGIN_SRC sql
  CREATE OR REPLACE VIEW v_initiative_tag AS
    SELECT i.id, json_agg(tag_text.value) AS tags
    FROM initiative i
    JOIN jsonb_array_elements(q32) tag_elements ON true
    JOIN jsonb_each_text(tag_elements) tag_text ON true
    GROUP BY i.id;
#+END_SRC

#+BEGIN_SRC sql
  CREATE VIEW v_initiative_search_text AS
  SELECT id,
     to_tsvector('english'::regconfig, (COALESCE(TRIM('"' FROM i.q2::text), ''::text) || ' '::text) || COALESCE(TRIM('"' FROM q3::text), ''::text)) AS search_text
    FROM v_initiative i
   ORDER BY i.created;
#+END_SRC

#+BEGIN_SRC sql
  CREATE OR REPLACE VIEW v_initiative_geo_coverage AS
    SELECT
    i.id,
    lower(geo_cov_type.key) AS geo_coverage_type,
    null AS geo_coverage_values
    FROM initiative i
    JOIN jsonb_each_text(q24) geo_cov_type ON true
    WHERE geo_cov_type.key = 'Global'
    GROUP BY i.id, geo_cov_type.value, geo_cov_type.key

    UNION ALL

    SELECT
    i.id,
    geo_cov_type.key AS geo_coverage_type,
    json_agg(regions_text.value) AS geo_coverage_values
    FROM initiative i
    JOIN jsonb_each_text(q24) geo_cov_type ON true
    JOIN jsonb_array_elements(q24_1) regions ON true
    JOIN jsonb_each_text(regions) regions_text ON true
    WHERE geo_cov_type.key = 'regional'
    GROUP BY i.id, geo_cov_type.value, geo_cov_type.key

    UNION ALL

    SELECT
    i.id,
    geo_cov_type.key AS geo_coverage_type,
    json_agg(c.iso_code) AS geo_coverage_value
    FROM initiative i
    JOIN jsonb_each_text(q24) geo_cov_type ON true
    JOIN jsonb_each_text(q24_2) countries ON true
    LEFT JOIN country c ON c.id = countries.key::int
    WHERE geo_cov_type.key = 'national' OR geo_cov_type.key = 'sub-national'
    GROUP BY i.id, geo_cov_type.value, geo_cov_type.key

    UNION ALL

    SELECT
    i.id,
    geo_cov_type.key AS geo_coverage_type,
    json_agg(c.iso_code) AS geo_coverage_value
    FROM initiative i
    JOIN jsonb_each_text(q24) geo_cov_type ON true
    JOIN jsonb_array_elements(q24_4) countries ON true
    JOIN jsonb_each_text(countries) countries_text ON true
    LEFT JOIN country c ON c.id = countries_text.key::int
    WHERE geo_cov_type.key = 'transnational'
    GROUP BY i.id, geo_cov_type.value, geo_cov_type.key;
#+END_SRC

#+BEGIN_SRC sql
  CREATE VIEW v_initiative_data AS
    SELECT i.id,
        null AS uuid,
        null AS phase,
        i.q36 AS funds,
        i.q37 AS contribution,
        i.created,
        i.modified,
        TRIM('"' FROM q2::text) AS title,
        v_gc.geo_coverage_type,
        TRIM('"' FROM q3::text) AS summary,
        i.reviewed_at,
        i.reviewed_by,
        i.review_status,
        TRIM('"' FROM q41_1::text) AS url,
        null AS image,
        v_t.tags,
        v_gc.geo_coverage_values
    FROM initiative i
    LEFT JOIN v_initiative_tag as v_t ON i.id = v_t.id
    LEFT JOIN v_initiative_geo_coverage as v_gc ON i.id = v_gc.id
    ORDER BY i.created;
#+END_SRC

#+BEGIN_SRC sql
  DROP VIEW v_topic;
  CREATE VIEW v_topic AS
   SELECT * FROM (
     SELECT 'project'::text AS topic,
        geo.geo_coverage_iso_code,
        st.search_text,
        row_to_json(p.*) AS json
       FROM v_project_data p
         LEFT JOIN v_project_geo geo ON p.id = geo.id
         LEFT JOIN v_project_search_text st ON p.id = st.id

    UNION ALL

      SELECT 'initiative'::text AS topic,
          '***' AS iso_code,
          st.search_text,
          row_to_json(i.*) AS json
          FROM v_initiative_data i
          LEFT JOIN v_initiative_search_text st ON i.id = st.id
          WHERE i.geo_coverage_type = 'global'

      UNION ALL

    SELECT 'initiative'::text AS topic,
        null AS iso_code,
        st.search_text,
        row_to_json(i.*) AS json
        FROM v_initiative_data i
        LEFT JOIN v_initiative_search_text st ON i.id = st.id
        WHERE i.geo_coverage_type = 'regional'

    UNION ALL

      SELECT 'initiative'::text AS topic,
          TRIM('"' FROM iso_code::text),
          st.search_text,
          row_to_json(i.*) AS json
          FROM v_initiative_data i
          LEFT JOIN json_array_elements(i.geo_coverage_values) iso_code ON true
          LEFT JOIN v_initiative_search_text st ON i.id = st.id
          WHERE i.geo_coverage_type = 'national' OR i.geo_coverage_type = 'transnational' OR i.geo_coverage_type = 'sub-national'
     ) data
     ORDER BY json->>'created';
#+END_SRC

#+RESULTS:
| topic      | geo_coverage_iso_code | search_text                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          | json                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              |
|------------+-----------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| initiative | IDN                   | 'desc':2 'test':1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    | {"id":10005,"uuid":null,"phase":null,"funds":1000,"contribution":300,"created":"2021-04-28T08:33:10.357298+00:00","modified":"2021-04-28T08:33:10.357298+00:00","title":"Testing","geo_coverage_type":"national","summary":"Desc","reviewed_at":null,"reviewed_by":null,"review_status":"SUBMITTED","url":"url","image":null,"tags":["Coastal zone", "Waste disposal sites", "Urban environment"],"geo_coverage_values":["IDN"]}                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  |
| initiative | ASM                   | 'desc':2 'test':1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    | {"id":10004,"uuid":null,"phase":null,"funds":1000,"contribution":300,"created":"2021-04-28T08:24:31.608711+00:00","modified":"2021-04-28T08:24:31.608711+00:00","title":"Testing","geo_coverage_type":"transnational","summary":"Desc","reviewed_at":null,"reviewed_by":null,"review_status":"SUBMITTED","url":"url","image":null,"tags":["Coastal zone", "Waste disposal sites", "Urban environment"],"geo_coverage_values":["AFG", "ALA", "ASM"]}                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               |
| initiative | AFG                   | 'desc':2 'test':1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    | {"id":10004,"uuid":null,"phase":null,"funds":1000,"contribution":300,"created":"2021-04-28T08:24:31.608711+00:00","modified":"2021-04-28T08:24:31.608711+00:00","title":"Testing","geo_coverage_type":"transnational","summary":"Desc","reviewed_at":null,"reviewed_by":null,"review_status":"SUBMITTED","url":"url","image":null,"tags":["Coastal zone", "Waste disposal sites", "Urban environment"],"geo_coverage_values":["AFG", "ALA", "ASM"]}                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               |
| initiative | ALA                   | 'desc':2 'test':1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    | {"id":10004,"uuid":null,"phase":null,"funds":1000,"contribution":300,"created":"2021-04-28T08:24:31.608711+00:00","modified":"2021-04-28T08:24:31.608711+00:00","title":"Testing","geo_coverage_type":"transnational","summary":"Desc","reviewed_at":null,"reviewed_by":null,"review_status":"SUBMITTED","url":"url","image":null,"tags":["Coastal zone", "Waste disposal sites", "Urban environment"],"geo_coverage_values":["AFG", "ALA", "ASM"]}                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               |
| initiative |                       | 'desc':2 'test':1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    | {"id":10003,"uuid":null,"phase":null,"funds":1000,"contribution":300,"created":"2021-04-28T07:55:09.871432+00:00","modified":"2021-04-28T07:55:09.871432+00:00","title":"Testing","geo_coverage_type":"regional","summary":"Desc","reviewed_at":null,"reviewed_by":null,"review_status":"SUBMITTED","url":"url","image":null,"tags":["Coastal zone", "Waste disposal sites", "Urban environment"],"geo_coverage_values":["Africa", "Europe", "North America", "West Asia"]}                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       |
| initiative | ***                     | 'desc':2 'test':1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    | {"id":10002,"uuid":null,"phase":null,"funds":1000,"contribution":300,"created":"2021-04-28T07:49:27.931387+00:00","modified":"2021-04-28T07:49:27.931387+00:00","title":"Testing","geo_coverage_type":"global","summary":"Desc","reviewed_at":null,"reviewed_by":null,"review_status":"SUBMITTED","url":"url","image":null,"tags":["Coastal zone", "Waste disposal sites", "Urban environment"],"geo_coverage_values":null}                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       |
| initiative | ***                     | 'desc':2 'test':1                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    | {"id":10001,"uuid":null,"phase":null,"funds":1000,"contribution":300,"created":"2021-04-28T07:28:08.892287+00:00","modified":"2021-04-28T07:28:08.892287+00:00","title":"Testing","geo_coverage_type":"global","summary":"Desc","reviewed_at":null,"reviewed_by":null,"review_status":"SUBMITTED","url":"url","image":null,"tags":["Coastal zone", "Waste disposal sites", "Urban environment"],"geo_coverage_values":null}                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                       |
| project    | AGO                   | 'agenc':39 'aim':64 'basel':19,49 'centr':24,54,61 'contribut':77 'convent':22,50,57 'cooper':42 'coordin':53 'countri':74 'develop':41 'fund':35 'grant':2,26 'implement':47 'improv':66 'manag':68 'marin':83 'norad':43 'norwegian':38 'partner':73 'plastic':5,12,33,70 'pollut':84 'prevent':79 'programm':3,27 'project':10,45,63 'reduc':82 'region':23,51,58 'seri':8 'sgp':28,31 'short':30 'signific':81 'small':1,25 'stockholm':21,56 'subregion':60 'thus':76 'toward':78 'undertaken':16 'wast':6,13,34,71                                                                                                                                                                             | {"id":4,"uuid":"545728-545719-69407601","phase":0,"funds":2000000,"contribution":50000,"created":"2021-03-11T12:21:58.060893+00:00","modified":"2021-03-11T12:21:58.060893+00:00","title":"Small Grant Programme on Plastic Waste","geo_coverage_type":"transnational","summary":"A series of projects on plastic waste are being undertaken under the Basel and Stockholm Conventions’ Regional Centre Small Grants Programme (SGP) - in short ‘SGP on plastic waste’. Funded by the Norwegian Agency for Development Cooperation (Norad),  these projects are implemented by Basel Convention regional and coordinating centres and Stockholm Convention regional and subregional centres. The projects aim to improve the management of plastic waste in partner countries and thus contribute towards preventing and significantly reducing marine pollution.","reviewed_at":null,"reviewed_by":null,"review_status":"APPROVED","url":null,"image":"https://storage.googleapis.com/akvo-unep-gpml/images/activity_545728-545719-69407601.png","tags":null,"geo_coverage_values":["AFG", "ALB", "DZA", "AGO", "ATG", "ARG", "ARM", "AUS", "AUT", "AZE", "BHS", "BHR", "BGD", "BRB", "BLR", "BEL", "BLZ", "BEN", "BTN", "BIH", "BWA", "BRA", "BRN", "BGR", "BFA", "BDI", "KHM", "CMR", "CAN", "CAF", "TCD", "CHL", "CHN", "COL", "COM", "COG", "CRI", "HRV", "CUB", "CYP", "CZE", "COD", "DNK", "DJI", "DMA", "DOM", "ECU", "EGY", "SLV", "GNQ", "ERI", "EST", "SWZ", "ETH", "FJI", "FIN", "FRA", "GAB", "GMB", "GEO", "DEU", "GHA", "GRC", "GTM", "GIN", "GNB", "GUY", "HTI", "HND", "HUN", "ISL", "IND", "IDN", "IRQ", "IRL", "ISR", "ITA", "JAM", "JPN", "JOR", "KAZ", "KEN", "KIR", "KWT", "KGZ", "LAO", "LVA", "LBN", "LSO", "LBR", "LBY", "LIE", "LTU", "LUX", "MDG", "MWI", "MYS", "MDV", "MLI", "MLT", "MHL", "MRT", "MUS", "MEX", "FSM", "MCO", "MNG", "MNE", "MAR", "MOZ", "MMR", "NAM", "NRU", "NPL", "NLD", "NZL", "NIC", "NER", "NGA", "NOR", "OMN", "PAK", "PLW", "PAN", "PNG", "PRY", "PER", "PHL", "POL", "PRT", "QAT", "KOR", "ROU", "RUS", "RWA", "KNA", "LCA", "VCT", "WSM", "STP", "SAU", "SEN", "SRB", "SYC", "SLE", "SGP", "SVK", "SVN", "SLB", "SOM", "ZAF", "ESP", "LKA", "SDN", "SUR", "SWE", "CHE", "SYR", "THA", "TGO", "TON", "TTO", "TUN", "TUR", "TKM", "TUV", "UGA", "UKR", "ARE", "GBR", "TZA", "USA", "URY", "UZB", "VUT", "VEN", "VNM", "YEM", "ZMB", "ZWE"]} |
| project    | DZA                   | 'agenc':39 'aim':64 'basel':19,49 'centr':24,54,61 'contribut':77 'convent':22,50,57 'cooper':42 'coordin':53 'countri':74 'develop':41 'fund':35 'grant':2,26 'implement':47 'improv':66 'manag':68 'marin':83 'norad':43 'norwegian':38 'partner':73 'plastic':5,12,33,70 'pollut':84 'prevent':79 'programm':3,27 'project':10,45,63 'reduc':82 'region':23,51,58 'seri':8 'sgp':28,31 'short':30 'signific':81 'small':1,25 'stockholm':21,56 'subregion':60 'thus':76 'toward':78 'undertaken':16 'wast':6,13,34,71                                                                                                                                                                             | {"id":4,"uuid":"545728-545719-69407601","phase":0,"funds":2000000,"contribution":50000,"created":"2021-03-11T12:21:58.060893+00:00","modified":"2021-03-11T12:21:58.060893+00:00","title":"Small Grant Programme on Plastic Waste","geo_coverage_type":"transnational","summary":"A series of projects on plastic waste are being undertaken under the Basel and Stockholm Conventions’ Regional Centre Small Grants Programme (SGP) - in short ‘SGP on plastic waste’. Funded by the Norwegian Agency for Development Cooperation (Norad),  these projects are implemented by Basel Convention regional and coordinating centres and Stockholm Convention regional and subregional centres. The projects aim to improve the management of plastic waste in partner countries and thus contribute towards preventing and significantly reducing marine pollution.","reviewed_at":null,"reviewed_by":null,"review_status":"APPROVED","url":null,"image":"https://storage.googleapis.com/akvo-unep-gpml/images/activity_545728-545719-69407601.png","tags":null,"geo_coverage_values":["AFG", "ALB", "DZA", "AGO", "ATG", "ARG", "ARM", "AUS", "AUT", "AZE", "BHS", "BHR", "BGD", "BRB", "BLR", "BEL", "BLZ", "BEN", "BTN", "BIH", "BWA", "BRA", "BRN", "BGR", "BFA", "BDI", "KHM", "CMR", "CAN", "CAF", "TCD", "CHL", "CHN", "COL", "COM", "COG", "CRI", "HRV", "CUB", "CYP", "CZE", "COD", "DNK", "DJI", "DMA", "DOM", "ECU", "EGY", "SLV", "GNQ", "ERI", "EST", "SWZ", "ETH", "FJI", "FIN", "FRA", "GAB", "GMB", "GEO", "DEU", "GHA", "GRC", "GTM", "GIN", "GNB", "GUY", "HTI", "HND", "HUN", "ISL", "IND", "IDN", "IRQ", "IRL", "ISR", "ITA", "JAM", "JPN", "JOR", "KAZ", "KEN", "KIR", "KWT", "KGZ", "LAO", "LVA", "LBN", "LSO", "LBR", "LBY", "LIE", "LTU", "LUX", "MDG", "MWI", "MYS", "MDV", "MLI", "MLT", "MHL", "MRT", "MUS", "MEX", "FSM", "MCO", "MNG", "MNE", "MAR", "MOZ", "MMR", "NAM", "NRU", "NPL", "NLD", "NZL", "NIC", "NER", "NGA", "NOR", "OMN", "PAK", "PLW", "PAN", "PNG", "PRY", "PER", "PHL", "POL", "PRT", "QAT", "KOR", "ROU", "RUS", "RWA", "KNA", "LCA", "VCT", "WSM", "STP", "SAU", "SEN", "SRB", "SYC", "SLE", "SGP", "SVK", "SVN", "SLB", "SOM", "ZAF", "ESP", "LKA", "SDN", "SUR", "SWE", "CHE", "SYR", "THA", "TGO", "TON", "TTO", "TUN", "TUR", "TKM", "TUV", "UGA", "UKR", "ARE", "GBR", "TZA", "USA", "URY", "UZB", "VUT", "VEN", "VNM", "YEM", "ZMB", "ZWE"]} |
| project    | TGO                   | '2017':49 '2030':19 'afforest':68 'afternoon':27 'agenda':18 'amongst':3 'apart':60 'aspect':16 'awar':2 'award':57 'campaign':75 'categori':59 'clean':73 'clean-up':72 'club':9,10 'coastlin':86 'communiti':71 'debat':28,39,62 'die':88 'differ':15 'e.g':80 'ecosystem':44 'energi':55 'etc':92 'focus':41 'free':84 'globe':56 'held':30 'includ':20 'involv':65 'leader':11 'life':22 'lome':82 'make':81 'manag':70 'marin':43 'microplast':47 'monday':26 'month':38 'nation':58 'organis':7 'pick':33 'plastic':45,83 'project':51,79 'rais':1 'receiv':12 'recent':37 'school':67 'silenc':91 'stop':89 'student':4,5,32,63 'topic':35 'train':13 'unep':54 'wast':69 'water':24 'won':52 | {"id":3,"uuid":"545728-545719-54464771","phase":1,"funds":5000,"contribution":1000,"created":"2021-03-11T12:21:58.060893+00:00","modified":"2021-03-11T12:21:58.060893+00:00","title":"Raising Awareness Amongst Students","geo_coverage_type":"sub-national","summary":"Students are organised into clubs . Club leaders receive training on different aspects of Agenda 2030 including on Life under Water. Each Monday afternoon debates are held where students pick a topic. In recent months debates have focused on marine ecosystem,  plastics and microplastics. In 2017 this project won the UNEP ENERGY GLOBE AWARD (National Category). Apart from debates students are involved in school afforestation,  waste management,  community clean-up campaigns and in our projects e.g. Make Lome Plastic Free,  Our coastline is dying,  stop the silence,  etc.","reviewed_at":null,"reviewed_by":null,"review_status":"APPROVED","url":null,"image":"https://storage.googleapis.com/akvo-unep-gpml/images/activity_545728-545719-54464771.jpg","tags":null,"geo_coverage_values":["TGO"]}                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              |
